In [88]:
# Import Libraries and Dependencies
import pandas as pd

### 1. Combine and Clean the Data
#### Import CSVs

In [89]:
# Read the CSV files into DataFrames.
sales_2020 = "/Users/robbstenman/Desktop/AI_Bootcamp/Homework/athletic_sales_analysis/Resources/athletic_sales_2020.csv"
sales_2021 = "/Users/robbstenman/Desktop/AI_Bootcamp/Homework/athletic_sales_analysis/Resources/athletic_sales_2021.csv"

sales_2020_df = pd.read_csv(sales_2020)
sales_2021_df = pd.read_csv(sales_2021)

In [90]:
# Display the 2020 sales DataFrame
sales_2020_df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [91]:
# Display the 2021 sales DataFrame
sales_2021_df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,65,750,487500,121875.00,Outlet
1,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,51,233,11883,3208.41,Outlet
2,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,50,275,137500,82500.00,Outlet
3,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,47,77,3619,2714.25,Online
4,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,64,225,14400,5184.00,Online

#### Check the data types of each DataFrame

In [92]:
# Check the 2020 sales data types.
sales_2020_df.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [93]:
# Check the 2021 sales data types.
sales_2021_df.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Combine the sales data by rows.

In [94]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.
sales_2020_2021_df = pd.concat([sales_2020_df, sales_2021_df], join='inner', axis=0)

indexed_df = sales_2020_2021_df.reset_index(drop=True)
indexed_df

display(indexed_df.head())

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [95]:
# Check if any values are null.
null_values = indexed_df.isnull().any()
print(null_values)

retailer            False
retailer_id         False
invoice_date        False
region              False
state               False
city                False
product             False
price_per_unit      False
units_sold          False
total_sales         False
operating_profit    False
sales_method        False
dtype: bool

In [96]:
# Check the data type of each column
indexed_df.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [99]:
# Convert the "invoice_date" to a datetime datatype
indexed_df["invoice_date"] = pd.to_datetime(indexed_df["invoice_date"])

In [101]:
# Confirm that the "invoice_date" data type has been changed.
indexed_df.dtypes

retailer                    object
retailer_id                  int64
invoice_date        datetime64[ns]
region                      object
state                       object
city                        object
product                     object
price_per_unit               int64
units_sold                   int64
total_sales                  int64
operating_profit           float64
sales_method                object
dtype: object

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [48]:
# Show the number products sold for region, state, and city.
# Rename the sum to "Total_Products_Sold".

# Sorting by "Total_Products_Sold" in descending order.

# Show the top 5 results.

#### Using `pivot_table`

In [102]:
# Show the number products sold for region, state, and city.
pivot_table = pd.pivot_table(indexed_df, values='units_sold', index=['region', 'state', 'city'], aggfunc='sum')

# Rename the "units_sold" column to "Total_Products_Sold"
pivot_table.columns = ["Total_Products_Sold"]
sort_pivot_table = pivot_table.sort_values(by="Total_Products_Sold", ascending=False)

# Show the top 5 results.
sort_pivot_table.head(5)

                                    Total_Products_Sold
region    state      city
Northeast New York   New York                    111954
South     Texas      Houston                      90322
West      California San Francisco                85478
                     Los Angeles                  76384
Southeast Florida    Miami                        73135

### 3. Determine which Region had the Most Sales

#### Using `groupby`

In [50]:
# Show the total sales for the products sold for each region, state, and city.
# Rename the "total_sales" column to "Total Sales"

# Show the top 5 results.

#### Using `pivot_table`

In [103]:
# Show the total sales for the products sold for each region, state, and city.
pivot_most_sales_df = pd.pivot_table(indexed_df, values="total_sales", index=["region", "state", "city"], aggfunc="sum")

# Optional: Rename the "total_sales" column to "Total Sales"
pivot_most_sales_df.rename(columns={"total_sales": "Total Sales"}, inplace=True)

# Sorting by "Total Sales" in descending order.
pivot_most_sales_df = pivot_most_sales_df.sort_values(by="Total Sales", ascending=False)

# Show the top 5 results.
pivot_most_sales_df.head()

                                        Total Sales
region    state          city
Northeast New York       New York          39801235
West      California     San Francisco     33973228
Southeast Florida        Miami             31600863
          South Carolina Charleston        29285637
          Florida        Orlando           27682851

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [52]:
# Show the total sales for the products sold for each retailer, region, state, and city.
# Rename the "total_sales" column to "Total Sales"

# Show the top 5 results.

#### Using `pivot_table`

In [104]:
# Show the total sales for the products sold for each retailer, region, state, and city.
pivot_retailer_sales_df = pd.pivot_table(indexed_df, values="total_sales", index=["retailer", "region", "state", "city"], aggfunc="sum")

# Optional: Rename the "total_sales" column to "Total Sales"
pivot_retailer_sales_df.rename(columns={"total_sales": "Total Sales"}, inplace=True)
# pivot_retailer_sales_df.columns = ["Total Sales"]

# Sorting by "Total Sales" in descending order.
sorted_pivot_retailer_sales = pivot_retailer_sales_df.sort_values(by="Total Sales", ascending=False)

# Show the top 5 results.
sorted_pivot_retailer_sales.head()

                                                    Total Sales
retailer    region    state          city
West Gear   West      California     San Francisco     32794405
Kohl's      West      California     Los Angeles       25127160
Foot Locker Northeast New York       New York          25008568
West Gear   West      Washington     Seattle           24862675
Foot Locker Southeast South Carolina Charleston        24822280

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [105]:
# Filter the sales data to get the women's athletic footwear sales data.
filtered_womens_df = indexed_df[indexed_df['product'].str.contains('Women\'s Athletic Footwear')]
filtered_womens_df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
21,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,36,281,10116,3742.92,Outlet
22,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,41,247,10127,4658.42,Online
23,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,45,850,382500,133875.00,In-store
26,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,45,300,135000,47250.00,Outlet
27,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,34,90,3060,1254.60,Outlet

#### Using `groupby`

In [55]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"

# Show the top 5 results.

#### Using `pivot_table`

In [106]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
pivot_womens_ath_footwear_df = pd.pivot_table(filtered_womens_df, values="units_sold", index=["retailer", "region", "state", "city"], aggfunc="sum")

# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
pivot_womens_ath_footwear_df.columns = ["Womens_Footwear_Units_Sold"]

# Sorting by "Womens_Footwear_Units_Sold" in descending order
sorted_pivot_womens_athletic_footwear = pivot_womens_ath_footwear_df.sort_values(by="Womens_Footwear_Units_Sold", ascending=False)

# Show the top 5 results.
sorted_pivot_womens_athletic_footwear.head()

                                                      Womens_Footwear_Units_Sold
retailer      region    state          city
West Gear     West      California     San Francisco                       12107
Foot Locker   Northeast New York       New York                            10996
Kohl's        West      California     Los Angeles                         10826
Foot Locker   Southeast South Carolina Charleston                           8814
Sports Direct South     Texas          Dallas                               8790

### 5. Determine the Day with the Most Women's Athletic Footwear Sales

In [77]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.
pivot_daily_sales_df = pd.pivot_table(filtered_womens_df, values="total_sales", index="invoice_date", aggfunc="sum")

# Optional: Rename the "total_sales" column to "Total Sales"
pivot_daily_sales_df.rename(columns={"total_sales": "Total Sales"}, inplace=True)

# Show the table.
pivot_daily_sales_df.head()

              Total Sales
invoice_date
2020-01-04         402743
2020-01-05         141801
2020-01-11         129556
2020-01-17         173013
2020-01-22         388250

In [86]:
# Resample the pivot table into daily bins, and get the total sales for each day.
daily_sales_total = pivot_daily_sales_df.resample("D").sum()

# Sort the resampled pivot table in ascending order on "Total Sales".
sorted_daily_sales_total  = daily_sales_total.sort_values(by="Total Sales", ascending=False)

sorted_daily_sales_total.head(10)

              Total Sales
invoice_date
2021-07-16        1521825
2021-12-16        1473497
2021-06-17        1376988
2021-08-17        1086294
2021-07-23        1021806
2021-11-17        1021145
2021-12-09         915011
2021-06-24         884238
2021-07-09         869054
2021-08-10         839120

### 6.  Determine the Week with the Most Women's Athletic Footwear Sales

In [87]:
# Resample the pivot table into weekly bins, and get the total sales for each week.
daily_sales_total = pivot_daily_sales_df.resample("W").sum()

# Sort the resampled pivot table in ascending order on "Total Sales".
sorted_daily_sales_total  = daily_sales_total.sort_values(by="Total Sales", ascending=False)

sorted_daily_sales_total.head(10)

              Total Sales
invoice_date
2021-12-19        3098970
2021-12-12        2922161
2021-07-11        2835078
2021-07-18        2801449
2021-11-14        2531721
2021-08-22        2491259
2021-08-15        2463941
2021-11-21        2449537
2021-05-16        2422132
2021-06-13        2358602